OpenFOAM/foam9tutorials/interfluo/OpenFOAM-pimpleFoam-RAS-3D-Wing-main/OpenFOAM-pimpleFoam-RAS-3D-Wing-main/airfoil_rotating_reversed/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0.1;
    }
	
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0.1;
    }
	
    wing
    {
        type            nutkWallFunction;
        value           uniform 0.1;
    }
	
    wall1
    {
        type            zeroGradient;
    }
	
    wall2
    {
        type            zeroGradient;
    }
	
    wall3
    {
        type            nutkWallFunction;
        value           uniform 0.1;
    }
	
    wall4
    {
        type            nutkWallFunction;
        value           uniform 0.1;
    }
	
    wall5
    {
        type            nutkWallFunction;
        value           uniform 0.1;
    }
	
    wall6
    {
        type            nutkWallFunction;
        value           uniform 0.1;
    }
}

// ************************************************************************* //
